app/Controllers/admin.php

    public function inbox()
    {
        $inbox = new ReservationModel();
        $data = [
            'book' => $inbox->findAll()
        ];
---
SELECT *
FROM `reservation`

    public function contactus()
    {
        $inbox = new ContactModel();
        $data = [
            'feeds' => $inbox->findAll()
        ];
---
SELECT *
FROM `contact`

    public function orders()
    {

        $order_model = new PlaceOrderModel();
        $data = [
            'placeorder' => $order_model->select('*')
                ->join('menu', 'menu.id = orders.menuid', 'right')
                ->join('user', 'user.id = orders.userid', 'right')
                ->where('state', 'Pending')
                ->get()->getResultArray()
        ];
---
SELECT *
FROM `orders`
RIGHT JOIN `menu` ON `menu`.`id` = `orders`.`menuid`
RIGHT JOIN `user` ON `user`.`id` = `orders`.`userid`
WHERE `state` = 'pending'

    public function accept($id, $userid)
    {
        $place_order = new PlaceOrderModel();
        $place_order->set('state', 'approved')->where('userid', $userid)
            ->where('menuid', $id)->update();
---
UPDATE `orders` SET `state` = 'approved', `updated_at` = '2023-01-24 15:15:39'
WHERE `userid` = '41'
AND `menuid` = '24'