app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'johnrexgerard03@gmail.com'
 LIMIT 1
---
    public function check()
    {
        $validation = $this->validate([
            'email' => [
                'rules' => 'required|valid_email|is_not_unique[user.email]',
                'errors' => [
                    'required' => 'Email is required.',
                    'valid_email' => 'Enter valid email adress',
                    'is_not_unique' => 'This email is not registered in our service.'
                ]
            ],
            'password' => [
                'rules' => 'required|min_length[8]|max_length[15]',
                'errors' => [
                    'required' => 'Password is required!',
                    'min_length' => 'Password must have atleast 8 characters in length.',
                    'max_length' => 'Passwords must not have characters more than 15 in lenth.'
                ]
            ]
        ]);

        if (!$validation) {
            return view('auth/login', ['validation' => $this->validator]);
        } else {
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $usersModel = new \App\Models\UsersModel();
            $user_info = $usersModel->where('email', $email)->first();