app/Controllers/home.php

SELECT *
FROM `products`
SELECT *
FROM `menu`
---
    public function homepage()
    {
        $prod = new MenuModel();
        $data = [
            'products' => $prod->findAll()
        ];

DELETE FROM `checkout`
WHERE `userid` = '41'
SELECT *
FROM `cart`
RIGHT JOIN `menu` ON `cart`.`menuid` = `menu`.`id`
WHERE `cart`.`userid` = '41'
SELECT SUM(`total`) AS `total`
FROM `cart`
WHERE `userid` = '41'
---
    public function cart()
    {
        $checkout = new \App\Models\CheckoutModel();

        $id = session()->get('id');
        $checkout->where('userid', $id)->delete();
        $cart_model = new CartModel();

        $cart['cart'] = $cart_model->select('*')
            ->join('menu', 'cart.menuid = menu.id', 'right')
            ->where('cart.userid', $id)->get()->getResultArray();

        $cart['total'] = $cart_model->selectSum('total')
            ->where('userid', $id)->get()->getResultArray();

INSERT INTO `checkout` (`menuid`, `userid`) VALUES ('24', '43')
SELECT *
FROM `checkout`
RIGHT JOIN `menu` ON `checkout`.`menuid` = `menu`.`id`
RIGHT JOIN `cart` ON `checkout`.`menuid` = `cart`.`menuid`
WHERE `checkout`.`userid` = '43'
SELECT SUM(`total`) AS `total`
FROM `checkout`
RIGHT JOIN `cart` ON `checkout`.`menuid` = `cart`.`menuid`
WHERE `checkout`.`userid` = '43'
---
    public function checkout()
    {
        $id = session()->get('id');

        $cart_id = $this->request->getPost('id[]');
        // var_dump($cart_id);

        if (isset($cart_id)) {
            $checkout_model = new \App\Models\CheckoutModel();

            for ($i = 0; $i < count($cart_id); $i++) {
                $checkout_model->insert(array('menuid' => $cart_id[$i], 'userid' => $id));
            }


            $cart["cart"] = $checkout_model->select('*')
                ->join('menu', 'checkout.menuid = menu.id', 'right')
                ->join('cart', 'checkout.menuid = cart.menuid', 'right')
                ->where('checkout.userid', $id)->get()->getResultArray();

            $cart['total'] = $checkout_model->selectSum('total')
            ->join('cart', 'checkout.menuid = cart.menuid', 'right')
            ->where('checkout.userid', $id)->get()->getResultArray();

SELECT *
FROM `menu`
WHERE `menu`.`id` = '25'
---
    public function single_product($id)
    {
        $prod = new MenuModel();

        $data['products'] = $prod->find($id);