app/Controllers/User.php

SELECT *
FROM `orders`
INNER JOIN `menu` ON `menu`.`id` = `orders`.`menuid`
WHERE `orders`.`userid` = '41'
AND `orders`.`state` = 'Pending'
---
    public function order_status(){

        $placeorder = new PlaceOrderModel();
        $data = [
            'placeorder' => $placeorder->select('*')
            ->join('menu', 'menu.id = orders.menuid', 'inner')
            ->where('orders.userid', session()->get('loggedUser'))
            ->where('orders.state', 'Pending')
            ->get()->getResultArray()
        ];