app/Models/MenuModel.php

SELECT *
FROM `menu`
---
    public function retrieve_mod()
    {
        $prod = new MenuModel();
        $data = [
            'products'=> $prod->findAll()
        ];