app/Models/ProductModel.php

    public function retrieve_mod()
    {
        $prod = new ProductModel();
        $data = [
            'products'=> $prod->findAll()
        ];
---
SELECT *
FROM `products`